testEdo/3D/combustor3D-wf-InitializationReavtingFoam/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver          EulerImplicit;
    chemistryThermo psi;
}

chemistry       off;

initialChemicalTimeStep 1e-08;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter on;
}

odeCoeffs
{
    solver          seulex;
    absTol          1e-12;
    relTol          0.1;
}

#include "$FOAM_CASE/constant/reactions";

// ************************************************************************* //
