testEdo/3D/combustor3D-wf-InitializationReavtingFoam/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFilmModel thermoSingleLayer;

regionName      wallFilmRegion;

active          true;

thermoSingleLayerCoeffs
{
    filmThermoModel liquid;

    liquidCoeffs
    {
        useReferenceValues  no;
        liquid      C7H16;
    }

    filmViscosityModel liquid;

    deltaWet    1e-4;

    hydrophilic no;

    radiationModel  none;

    turbulence  laminar;
    laminarCoeffs
    {
        Cf          0.005;
    }

    upperSurfaceModels
    {
        
        heatTransferModel constant;
        constantCoeffs
        {
            c0                1e-8;
        }
       
      //  heatTransferModel mappedConvectiveHeatTransfer;
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0              50;
        }
    }

    forces
    (
        thermocapillary
        distributionContactAngle
    );

    distributionContactAngleCoeffs
    {
        Ccf             0.085;

        distribution
        {
            type            normal;
            normalDistribution
            {
                minValue        50;
                maxValue        100;
                expectation     75;
                variance        100;
            }
        }

        zeroForcePatches ();
    }

    injectionModels 
    (
        curvatureSeparation
        drippingInjection
    );

    curvatureSeparationCoeffs
    {
        definedPatchRadii
        (
            ("region0_to_wallFilmRegion_wallFilmFaces" 0)
        );
    }

    drippingInjectionCoeffs
    {
        cloudName reactingCloud1;
        deltaStable 0;

        particlesPerParcel 10.0;

        parcelDistribution
        {
            type RosinRammler;
            RosinRammlerDistribution
            {
                minValue 1e-6;
                maxValue 1.5e-4;
                d        1.5e-4;
                n        3;
            }
        }
    }

    phaseChangeModel standardPhaseChange;

    standardPhaseChangeCoeffs
    {
        Tb              373;
        deltaMin        1e-8;
        L               1.0;
    }
