testEdo/3D/combustor3D-wf-InitializationReavtingFoam/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

 // WALLS BEGIN HERE
 	{
 		name    wallFilmFaceSet;
		type    faceSet;
		action  new;
		source  patchToFace;
		sourceInfo
 		{
 			name wall;
 		}
 	}

 	{
		name    wallFilmFaces;
		type    faceZoneSet;
		action  new;
		source  setToFaceZone;
 		sourceInfo
 		{
	 		faceSet wallFilmFaceSet;
 		}
 	}
);

// ************************************************************************* //
